[
  "auto-card-link",
  "automatic-table-of-contents",
  "obsidian-file-link",
  "canvas-css-class",
  "canvas-links",
  "colored-tags",
  "dataview",
  "edit-history",
  "folder-notes",
  "obsidian-hider",
  "highlightr-plugin",
  "image-converter",
  "linked-data-helper",
  "linked-data-vocabularies",
  "links",
  "obsidian-local-images-plus",
  "obsidian-local-rest-api",
  "map-of-content",
  "msg-handler",
  "graph-nested-tags",
  "persistent-links",
  "obsidian-rich-links",
  "obsidian-theme-design-utilities",
  "update-relative-links",
  "key-value-list",
  "obsidian-show-whitespace-cm6",
  "blockier",
  "canvas-llm-extender",
  "folder-note-core",
  "alx-folder-note",
  "obsidian-annotator",
  "image-helper",
  "pkvs",
  "image-inline",
  "obsidian-advanced-uri",
  "pdf-plus",
  "text-extractor",
  "sticky-heading",
  "folders2graph",
  "graph-link-types",
  "obsidian-underline",
  "statusbar-organizer",
  "last-modified-timestamp-in-status-bar",
  "media-extended",
  "obsidian42-brat",
  "obsidian-trash-explorer",
  "create-note-list",
  "obsidian-style-settings",
  "change-case",
  "obsidian-front-matter-title-plugin",
  "semantic-canvas",
  "file-explorer-plus",
  "neighbouring-files",
  "optimize-canvas-connections",
  "obsidian-outliner",
  "query-json",
  "quick-preview",
  "templater-obsidian",
  "obsidian-dataset-aid",
  "tabs",
  "docxer",
  "file-explorer-note-count",
  "bearings",
  "obsidian-snippet-downloader",
  "obsidian-custom-frames",
  "obsidian-citation-plugin",
  "canvas-mindmap",
  "canvas-card-bg-remover",
  "attachment-management",
  "augmented-canvas",
  "auto-classifier",
  "table-editor-obsidian",
  "advanced-canvas",
  "adjacency-matrix-maker",
  "abbreviations",
  "enhanced-tables",
  "obsidian-excalidraw-plugin",
  "obsidian-file-info-plugin",
  "obsidian-file-path-to-uri",
  "obsidian-folder-index",
  "file-index",
  "link-exploder",
  "link-nodes-in-canvas",
  "link-tree",
  "md-image-caption",
  "merge-notes",
  "mermaid-themes",
  "mermaid-tools",
  "obsidian-mind-map",
  "multi-properties",
  "multi-state-checkbox-switcher",
  "multi-tag",
  "obsidian-to-notion",
  "reference-generator",
  "reference-map",
  "show-whitespace-cm6",
  "tag-buddy",
  "tag-wrangler",
  "arrows-in-md",
  "graph-analysis",
  "obsidian-admonition",
  "juggl",
  "media-notes",
  "breadcrumbs",
  "custom-note-width",
  "canvas-explorer",
  "marker-api",
  "smart-templates",
  "3d-graph-new",
  "obsidian-icon-folder",
  "iconic",
  "tags-routes"
]