[
  "3d-graph",
  "adjacency-matrix-maker",
  "obsidian-admonition",
  "obsidian-advanced-slides",
  "table-editor-obsidian",
  "ai-research-assistant",
  "alx-folder-note",
  "obsidian-annotator",
  "aprils-automatic-timelines",
  "attachment-management",
  "obsidian-audio-notes",
  "auto-card-link",
  "auto-classifier",
  "auto-glossary",
  "obsidian-auto-link-title",
  "obsidian-plugin-groups",
  "auto-note-mover",
  "auto-tag",
  "automatic-table-of-contents",
  "obsidian-banners",
  "obsidian-file-link",
  "bmo-chatbot",
  "buttons",
  "calendar",
  "cannoli",
  "canvas-css-class",
  "canvas-links",
  "canvas-mindmap",
  "chat-stream",
  "obsidian-citation-plugin",
  "custom-sort",
  "colored-tags",
  "obsidian-custom-frames",
  "notion-like-tables",
  "dataview",
  "dbfolder",
  "obsidian-dictionary-plugin",
  "edit-history",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-excel-to-markdown-table",
  "file-diff",
  "obsidian-file-path-to-uri",
  "obsidian-folder-index",
  "folder-notes",
  "geocoding-properties",
  "github-embeds",
  "gpt-assistant",
  "gpt-liteinquirer",
  "graph-analysis",
  "obsidian-hider",
  "obsidian-icon-folder",
  "highlightr-plugin",
  "obsidian-importer",
  "image-converter",
  "juggl",
  "link-exploder",
  "link-nodes-in-canvas",
  "link-tree",
  "linked-data-helper",
  "linked-data-vocabularies",
  "links",
  "obsidian-local-images-plus",
  "obsidian-local-rest-api",
  "map-of-content",
  "merge-notes",
  "obsidian-mind-map",
  "msg-handler",
  "multi-tag",
  "graph-nested-tags",
  "obisidian-note-linker",
  "obsidian-to-notion",
  "optimize-canvas-connections",
  "obsidian-outliner",
  "persistent-links",
  "personal-assistant",
  "postgresql-obsidian",
  "progressbar",
  "reference-map",
  "obsidian-regex-replace",
  "obsidian-regex-pipeline",
  "obsidian-rich-links",
  "obsidian-shellcommands",
  "smart-connections",
  "obsidian-style-settings",
  "tag-wrangler",
  "obsidian-tasks-plugin",
  "templater-obsidian",
  "obsidian-dataset-aid",
  "obsidian-textgenerator-plugin",
  "obsidian-theme-design-utilities",
  "obsidian-tracker",
  "obsidian-transcription",
  "unitade",
  "update-relative-links",
  "obsidian-vocabulary-view",
  "whisper",
  "tag-buddy",
  "key-value-list",
  "disk-usage",
  "obsidian-trim-whitespace",
  "obsidian-show-whitespace-cm6",
  "show-whitespace-cm6",
  "3d-graph-new",
  "blockier",
  "file-index",
  "multi-properties",
  "enhance-youtube-links",
  "backlink-cache",
  "canvas-llm-extender",
  "scholar",
  "title-generator",
  "md-image-caption",
  "remove-empty-folders",
  "abbreviations",
  "timeline-view",
  "folder-note-core",
  "neighbouring-files"
]