{"cik":1579546,"entityName":"DELVERTON RESORTS INTERNATIONAL INC.","facts":{"dei":{"EntityCommonStockSharesOutstanding":{"label":"Entity Common Stock, Shares Outstanding","description":"Indicate number of shares or other units outstanding of each of registrant's classes of capital or common stock or other ownership interests, if and as stated on cover of related periodic report. Where multiple classes or units exist define each class/interest by adding class of stock items such as Common Class A [Member], Common Class B [Member] or Partnership Interest [Member] onto the Instrument [Domain] of the Entity Listings, Instrument.","units":{"shares":[{"end":"2014-03-01","val":6500000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2014Q1I"}]}},"EntityPublicFloat":{"label":"Entity Public Float","description":"The aggregate market value of the voting and non-voting common equity held by non-affiliates computed by reference to the price at which the common equity was last sold, or the average bid and asked price of such common equity, as of the last business day of the registrant's most recently completed second fiscal quarter.","units":{"USD":[{"end":"2013-12-31","val":0,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}}},"us-gaap":{"AdditionalPaidInCapital":{"label":"Additional Paid in Capital","description":"Excess of issue price over par or stated value of the entity's capital stock and amounts received from other transactions involving the entity's stock or stockholders. Includes adjustments to additional paid in capital. Some examples of such adjustments include recording the issuance of debt with a beneficial conversion feature and certain tax consequences of equity instruments awarded to employees. Use this element for the aggregate amount of additional paid-in capital associated with common and preferred stock. For additional paid-in capital associated with only common stock, use the element additional paid in capital, common stock. For additional paid-in capital associated with only preferred stock, use the element additional paid in capital, preferred stock.","units":{"USD":[{"end":"2013-12-31","val":85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"AdjustmentsToAdditionalPaidInCapitalOther":{"label":"Adjustments to Additional Paid in Capital, Other","description":"Amount of other increase (decrease) in additional paid in capital (APIC).","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"AssetsCurrent":{"label":"Assets, Current","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2013-12-31","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CashAndCashEquivalentsAtCarryingValue":{"label":"Cash and Cash Equivalents, at Carrying Value","description":"Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.","units":{"USD":[{"end":"2013-04-30","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q1I"},{"end":"2013-12-31","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CashAndCashEquivalentsPeriodIncreaseDecrease":{"label":"Cash and Cash Equivalents, Period Increase (Decrease)","description":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":0,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"CommonStockParOrStatedValuePerShare":{"label":"Common Stock, Par or Stated Value Per Share","description":"Face amount or stated value per share of common stock.","units":{"USD/shares":[{"end":"2013-12-31","val":0.0001,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CommonStockSharesAuthorized":{"label":"Common Stock, Shares Authorized","description":"The maximum number of common shares permitted to be issued by an entity's charter and bylaws.","units":{"shares":[{"end":"2013-12-31","val":100000000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CommonStockSharesIssued":{"label":"Common Stock, Shares, Issued","description":"Total number of common shares of an entity that have been sold or granted to shareholders (includes common shares that were issued, repurchased and remain in the treasury). These shares represent capital invested by the firm's shareholders and owners, and may be all or only a portion of the number of shares authorized. Shares issued include shares outstanding and shares held in the treasury.","units":{"shares":[{"end":"2013-12-31","val":5500000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CommonStockSharesOutstanding":{"label":"Common Stock, Shares, Outstanding","description":"Number of shares of common stock outstanding. Common stock represent the ownership interest in a corporation.","units":{"shares":[{"end":"2013-12-31","val":5500000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"CommonStockValue":{"label":"Common Stock, Value, Issued","description":"Aggregate par or stated value of issued nonredeemable common stock (or common stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable common shares, par value and other disclosure concepts are in another section within stockholders' equity.","units":{"USD":[{"end":"2013-12-31","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"DevelopmentStageEnterpriseDeficitAccumulatedDuringDevelopmentStage":{"label":"Development Stage Enterprise, Deficit Accumulated During Development Stage (Deprecated 2015-01-31)","description":"Cumulative net losses reported during the development stage.","units":{"USD":[{"end":"2013-12-31","val":87448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"EarningsPerShareBasicAndDiluted":{"label":"Earnings Per Share, Basic and Diluted","description":"The amount of net income or loss for the period per each share in instances when basic and diluted earnings per share are the same amount and reported as a single line item on the face of the financial statements. Basic earnings per share is the amount of net income or loss for the period per each share of common stock or unit outstanding during the reporting period. Diluted earnings per share includes the amount of net income or loss for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.","units":{"USD/shares":[{"start":"2013-05-01","end":"2013-12-31","val":0,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"GeneralAndAdministrativeExpense":{"label":"General and Administrative Expense","description":"The aggregate total of expenses of managing and administering the affairs of an entity, including affiliates of the reporting entity, which are not directly or indirectly associated with the manufacture, sale or creation of a product or product line.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"LiabilitiesAndStockholdersEquity":{"label":"Liabilities and Equity","description":"Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.","units":{"USD":[{"end":"2013-12-31","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"LiabilitiesCurrent":{"label":"Liabilities, Current","description":"Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer.","units":{"USD":[{"end":"2013-12-31","val":0,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"NetCashProvidedByUsedInFinancingActivities":{"label":"Net Cash Provided by (Used in) Financing Activities","description":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"NetCashProvidedByUsedInOperatingActivities":{"label":"Net Cash Provided by (Used in) Operating Activities","description":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":-85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"NetIncomeLoss":{"label":"Net Income (Loss) Attributable to Parent","description":"The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":-87448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"OperatingExpenses":{"label":"Operating Expenses","description":"Generally recurring costs associated with normal operations except for the portion of these expenses which can be clearly related to production and included in cost of sales or services. Includes selling, general and administrative expense.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":87448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"PreferredStockParOrStatedValuePerShare":{"label":"Preferred Stock, Par or Stated Value Per Share","description":"Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer.","units":{"USD/shares":[{"end":"2013-12-31","val":0.0001,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"PreferredStockSharesAuthorized":{"label":"Preferred Stock, Shares Authorized","description":"The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.","units":{"shares":[{"end":"2013-12-31","val":20000000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"PreferredStockSharesIssued":{"label":"Preferred Stock, Shares Issued","description":"Total number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) issued to shareholders (includes related preferred shares that were issued, repurchased, and remain in the treasury). May be all or portion of the number of preferred shares authorized. Excludes preferred shares that are classified as debt.","units":{"shares":[{"end":"2013-12-31","val":20000000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"PreferredStockSharesOutstanding":{"label":"Preferred Stock, Shares Outstanding","description":"Aggregate share number for all nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer) held by stockholders. Does not include preferred shares that have been repurchased.","units":{"shares":[{"end":"2013-12-31","val":20000000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"PreferredStockValue":{"label":"Preferred Stock, Value, Issued","description":"Aggregate par or stated value of issued nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable preferred shares, par value and other disclosure concepts are in another section within stockholders' equity.","units":{"USD":[{"end":"2013-12-31","val":2000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"ProceedsFromContributedCapital":{"label":"Proceeds from Contributed Capital","description":"The cash inflow associated with the amount received by a corporation from a shareholder during the period.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":85448,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"ProceedsFromIssuanceOfCommonStock":{"label":"Proceeds from Issuance of Common Stock","description":"The cash inflow from the additional capital contribution to the entity.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":2500,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"ProceedsFromIssuanceOfPreferredStockAndPreferenceStock":{"label":"Proceeds from Issuance of Preferred Stock and Preference Stock","description":"Proceeds from issuance of capital stock which provides for a specific dividend that is paid to the shareholders before any dividends to common stockholders and which takes precedence over common stockholders in the event of liquidation.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":2000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"ShareBasedCompensation":{"label":"Share-based Payment Arrangement, Noncash Expense","description":"Amount of noncash expense for share-based payment arrangement.","units":{"USD":[{"start":"2013-05-01","end":"2013-12-31","val":2000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}},"StockholdersEquity":{"label":"Stockholders' Equity Attributable to Parent","description":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.","units":{"USD":[{"end":"2013-04-30","val":0,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q1I"},{"end":"2013-12-31","val":550,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31","frame":"CY2013Q4I"}]}},"WeightedAverageNumberOfShareOutstandingBasicAndDiluted":{"label":"Weighted Average Number of Shares Outstanding, Basic and Diluted","description":"Average number of shares or units issued and outstanding that are used in calculating basic and diluted earnings per share (EPS).","units":{"shares":[{"start":"2013-05-01","end":"2013-12-31","val":3131000000,"accn":"0001493152-14-000923","fy":2013,"fp":"FY","form":"10-K","filed":"2014-03-31"}]}}}}}